---
kind: other
id: Properties.T:Autodesk.Revit.DB.DimensionSegmentArray
source: html/f225488f-c2ff-a505-97a8-adeb702e4fb6.htm
---
# DimensionSegmentArray Properties

Test to see if the array is empty.